# -*- coding: utf-8 -*-

import sqlite3

sql = """
replace into school 
values ('4000000671',   '西师附小'), 
       ('4000001020',   '中关村一小'), 
       ('4000001023',   '上地实验小学'), 
       ('47031207',     '朝阳外国语'),
       ('4000000683',   '育翔小学'),
       ('4000000666',   '裕中小学'),
       ('4000000686',   '五路通小学'),
       ('47715332',     '陶然亭小学'),
       ('47715578',     '八中附小'),
       ('4000000736',   '椿树馆小学'),
       ('4000000705',   '展一小'),
       ('4000000640',   '青年湖小学')
"""

c = sqlite3.connect('xuequfang.db')
try:
    with c:
        c.executescript(sql)
finally:
    c.close()
